Задание 1

In [77]:
import pandas as pd
import numpy as np

In [58]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                       'author_name': ['Тургенев', 'Чехов', 'Островский'],
                       })
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [59]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290],
                       })
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [60]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')

authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [61]:
top5 = authors_price.nlargest(5, 'price')

top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [62]:
groupby = authors_price.groupby("author_name")

In [63]:
authors_stat = pd.concat([groupby.agg({"price": "min"}), groupby.agg({"price": "max"}), groupby.agg({"price": "mean"})], axis=1)
authors_stat

             price  price       price
author_name
Островский     290    370  330.000000
Тургенев       300    450  366.666667
Чехов          450    500  475.000000

In [64]:
#Переименовываем столбцы
authors_stat.columns = ['min_price','max_price', 'mean_price']
authors_stat.round(1)

             min_price  max_price  mean_price
author_name
Островский         290        370       330.0
Тургенев           300        450       366.7
Чехов              450        500       475.0

Задание 5

In [79]:
df1 = pd.DataFrame(
    {'cover': ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']}

)

In [66]:
authors_price = pd.concat([authors_price, df1], axis=1)

authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [71]:
?pd.pivot_table

In [86]:
book_info = pd.pivot_table(authors_price, values='price', index = ['author_name'], columns=['cover'], aggfunc=np.sum)

book_info

cover        мягкая  твердая
author_name
Островский    660.0      NaN
Тургенев      650.0    450.0
Чехов           NaN    950.0

In [83]:
book_info['мягкая'].isnull().sum()

1

In [91]:
book_info.loc[book_info['мягкая'].isnull(), 'мягкая'] = 0
book_info.loc[book_info['твердая'].isnull(), 'твердая'] = 0
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [93]:
book_info.to_pickle("book_info.pkl")

In [95]:
book_info_2 = pd.read_pickle("book_info.pkl")
book_info_2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0